#ifndef MATHPHRASES_H
#define MATHPHRASES_H

const char* MATH_PHRASES[] = {
    "Заметим, что:",
    "Каждый советский пятиклассник в уме сможет посчитать это:",
    "Следующий факт слишком тривиален для нашей задачи:",
    "Следующее утверждение предоставляется читателю в качестве несложного упражнения:",
    "Нетрудно убедиться в том, что:",
    "По теореме Шмидта:",
    "По слествию из Китайской теоремы об остатках получаем:",
    "На прошлой лекции по математическому анализу было доказано:"
};

const int MATAN_PHRASES_COUNT = sizeof(MATH_PHRASES) / sizeof(MATH_PHRASES[0]);

#endif // MATHPHRASES_H