#ifndef MATHPHRASES_H
#define MATHPHRASES_H

const char* MATH_PHRASES[] = {
    "Заметим, что:",
    "Каждый советский пятиклассник в уме сможет посчитать это:",
    "Следующий факт слишком тривиален для нашей задачи:",
    "Следующее утверждение предоставляется читателю в качестве несложного упражнения:",
    "Нетрудно убедиться в том, что:",
    "По теореме Шмидта:",
    "По слествию из Китайской теоремы об остатках получаем:",
    "На прошлой лекции по математическому анализу было доказано:",
    "Следующее утверждение нам выдаст ChatGpt:",
    "Лучше этой производной может быть только её вторая производная:",
    "Для любого эпсилон больше 0:",
    "Из этого следует равенство:",
    "Следующий тривиальный факт вытекает из великой теоремы Ферма (докажите её самостоятельно):",
    "Путём нетрудных вычислений получим:",
    "А это вы найдёте на страницах Зорича [2 издание, страница 228]:",
    "Здесь должна была быть крутая фраза... но я ёё не придумал:",
    "Любой советский детсадовец понимает, что:",
    "Получаем результат, который впринципе мог бы быть подсчитаен и устно:"
};

const int MATAN_PHRASES_COUNT = sizeof(MATH_PHRASES) / sizeof(MATH_PHRASES[0]);

#endif // MATHPHRASES_H